{
  "name": "Baizhi",
  "quote": "No, I cannot place my faith in it, but my anticipation stems precisely from this distrust. A claim is always verifiable before it is discredited entirely.",
  "description": "Baizhi is a researcher in Remnant Ecoacoustics.\nBaizhi's once unfulfilled wish has now manifested as her loyal companion. The Remnant Creature You'tan is her source of healing powers, and a lifelong research focus.",
  "skills": {
    "destined-promise": {
      "name": "Destined Promise",
      "description": "<strong>Basic Attack</strong>\nBaizhi instructs You'tan to perform up to 4 consecutive attacks, dealing <strong class=\"color-glacio\">Glacio DMG</strong>.\n \n<strong>Heavy Attack</strong>\nBaizhi continuously consumes STA to command You'tan to attack enemies, dealing <strong class=\"color-glacio\">Glacio DMG</strong>. During Heavy Attack, Baizhi can command You'tan to move.\n \n<strong>Mid-air Attack</strong>\nBaizhi consumes STA and summons You’tan in mid-air to perform a Plunging Attack, dealing <strong class=\"color-glacio\">Glacio DMG</strong>.\n \n<strong>Dodge Counter</strong>\nUse <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to attack the target, dealing <strong class=\"color-glacio\">Glacio DMG</strong>."
    },
    "emergency-plan": {
      "name": "Emergency Plan",
      "description": "Baizhi calls You'tan to attack the target, dealing <strong class=\"color-glacio\">Glacio DMG</strong> while immediately healing all characters on nearby teams."
    },
    "momentary-union": {
      "name": "Momentary Union",
      "description": "Baizhi summons You'tan to heal all characters on nearby teams, generating <strong class=\"color-glacio\">4</strong> stacks of <strong>Remnant Entities</strong>.\n \n<strong>Remnant Entities</strong>\nRemnant Entities follow the active team members. <strong class=\"color-glacio\">1</strong> stacks of <strong>Remnant Entities</strong> are automatically consumed to attack the targets every <strong class=\"color-glacio\">2.5</strong>s, dealing <strong class=\"color-glacio\">Glacio DMG</strong> on hit while healing the active character on a nearby team."
    },
    "harmonic-range": {
      "name": "Harmonic Range",
      "description": "When Baizhi casts Resonance Skill <strong>Emergency Plan</strong>, You'tan generates a field of <strong>Euphonia</strong> that lasts for <strong style=\"color: var(--theme-palette-color-1);\">15</strong>s.\n \n<strong>Euphonia</strong>\nATK of the Resonators who picks up Euphonia is increased by <strong style=\"color: var(--theme-palette-color-1);\">15%</strong> for <strong style=\"color: var(--theme-palette-color-1);\">20</strong>s."
    },
    "stimulus-feedback": {
      "name": "Stimulus Feedback",
      "description": "Baizhi's <strong>Heavy Attack</strong> on hit heals the character with the lowest HP on a nearby team by <strong style=\"color: var(--theme-palette-color-1);\">0.25%</strong> of her Max HP."
    },
    "overflowing-frost": {
      "name": "Overflowing Frost",
      "description": "Baizhi calls You'tan to perform 1 plunging attack, dealing <strong class=\"color-glacio\">Glacio DMG</strong> while healing all characters on a nearby team."
    },
    "cycle-of-life": {
      "name": "Cycle of Life",
      "description": "<strong>You'tan</strong>\nA Remnant Creature that answers to Baizhi’s mind and desires while sharing all her stats. You’tan goes back to Baizhi when Baizhi dodges.\n \n<strong>Concentration</strong>\nBaizhi consumes all \"Concentrations\" when casting <strong>Heavy Attack</strong> or Resonance Skill <strong>Emergency Plan</strong> to continuously heal all characters on nearby teams. Each <strong style=\"color: var(--theme-palette-color-1);\">1</strong> \"Concentration\" consumed provides 1 healing. The healings happen every <strong style=\"color: var(--theme-palette-color-1);\">2</strong>s.\nWhen Baizhi consumes \"Concentration\" to cast <strong>Heavy Attack</strong>, Baizhi additionally restores Concerto Energy and Resonance Energy;\nWhen Baizhi consumes \"Concentration\" to cast Resonance Skill <strong>Emergency Plan</strong>, Baizhi additionally restores Concerto Energy.\n \n<strong>Forte Gauge: Concentration</strong>\nBaizhi can hold up to <strong style=\"color: var(--theme-palette-color-1);\">4</strong> \"Concentrations\".\nBaizhi obtains <strong style=\"color: var(--theme-palette-color-1);\">1</strong> \"Concentration\" for every <strong>Basic Attack</strong> on hit."
    },
    "skillful-cooking": {
      "name": "Skillful Cooking",
      "description": "Has a chance to produce special dishes when cooking"
    },
    "rejuvinating-flow": { "name": "Rejuvinating Flow", "description": "" }
  }
}
