{
  "name": "Encore",
  "quote": "A long, long time ago... Cosmos told Encore about a fun spot! Come on! Let's go check it out!",
  "description": "A girl accompanied by one black and one white Wooly plushies. Encore, consultant from the Black Shores, is longing to create happy stories with candies, fairy tales, and her imagination.",
  "skills": {
    "wooly-attack": {
      "name": "Wooly Attack",
      "description": "<strong>Basic Attack</strong>\nEncore performs up to 4 consecutive attacks, dealing <strong class=\"color-fusion\">Fusion DMG</strong>.\n \n<strong>Basic Attack: Wooly Strike</strong>\nAfter <strong>Basic Attack 4</strong>, press the Basic Attack button to attack the target, dealing <strong class=\"color-fusion\">Fusion DMG</strong>.\n \n<strong>Heavy Attack</strong>\nEncore consumes STA to attack the target, dealing <strong class=\"color-fusion\">Fusion DMG</strong>.\n \n<strong>Mid-air Attack</strong>\nEncore consumes STA to perform a Mid-Air Plunging Attack, dealing <strong class=\"color-fusion\">Fusion DMG</strong>.\n \n<strong>Dodge Counter</strong>\nUse <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to attack the target, dealing <strong class=\"color-fusion\">Fusion DMG</strong>."
    },
    "flaming-woolies": {
      "name": "Flaming Woolies",
      "description": "<strong>Flaming Woolies</strong>\r\nEncore summons Cloudy and Cosmos to attack with burning rays, dealing <strong class=\"color-fusion\">Fusion DMG</strong>.\r\n \r\n<strong>Energetic Welcome</strong>\r\nAfter casting <strong>Flaming Woolies</strong>, use <strong>Resonance Skill</strong> to perform <strong>Energetic Welcome</strong>, dealing <strong class=\"color-fusion\">Fusion DMG</strong>."
    },
    "cosmos-rave": {
      "name": "Cosmos Rave",
      "description": "As Encore loses control, Cosmos breaks free and wreaks havoc on its surroundings.\n \n<strong>Basic Attack: Cosmos - Frolicking</strong>\nDuring Cosmos Rave, the <strong>Basic Attack</strong> is replaced with <strong>Cosmos - Frolicking</strong>, which performs up to 4 consecutive attacks, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Basic Attack damage.\n \n<strong>Cosmos - Heavy Attack</strong>\nDuring Cosmos Rave, the <strong>Heavy Attack</strong> is replaced with <strong>Cosmos - Heavy Attack</strong>, consuming STA to attack the target, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Heavy Attack damage.\n \n<strong>Resonance Skill: Cosmos - Rampage</strong>\nDuring Cosmos Rave, <strong>Flaming Woolies</strong> is replaced with <strong>Cosmos - Rampage</strong>, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Resonance Skill damage.\n \n<strong>Cosmos - Dodge Counter</strong>\nDuring Cosmos Rave, use <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to attack the target, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Basic Attack damage."
    },
    "angry-cosmos": {
      "name": "Angry Cosmos",
      "description": "During the Resonance Liberation <strong>Cosmos Rave</strong>, when Encore's HP is above <strong style=\"color: var(--theme-palette-color-1);\">70%</strong>, DMG dealt is increased by <strong style=\"color: var(--theme-palette-color-1);\">10%</strong>."
    },
    "woolies-cheer-dance": {
      "name": "Woolies Cheer Dance",
      "description": "When Resonance Skill <strong>Flaming Woolies</strong> or Resonance Skill <strong>Cosmos - Rampage</strong> is cast, Encore's Fusion DMG Bonus is increased by <strong class=\"color-fusion\">10%</strong> for <strong class=\"color-fusion\">10</strong>s."
    },
    "woolies-can-help": {
      "name": "Woolies Can Help!",
      "description": "Encore pounces at the enemies with Cosmos, dealing <strong class=\"color-fusion\">Fusion DMG</strong>."
    },
    "black-white-woolies": {
      "name": "Black & White Woolies",
      "description": "<strong>Heavy Attack: Cloudy Frenzy</strong>\nWhen Encore's \"Mayhem\" is full, after casting a <strong>Heavy Attack</strong>, Encore will consume all \"Mayhem\" to enter the Mayhem state, reducing damage taken by <strong class=\"color-fusion\">70%</strong>. Switching Characters does not interrupt the Mayhem state.\nAfter the Mayhem state ends, Encore will cast <strong>Cloudy Frenzy</strong>, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Resonance Liberation damage.\n \n<strong>Heavy Attack: Cosmos Rupture</strong>\nDuring Cosmos Rampage, when casting <strong>Heavy Attack</strong>, if \"Mayhem\" is full, Encore will consume all \"Mayhem\" to enter Cosmos' Mayhem state, reducing damage taken by <strong class=\"color-fusion\">70%</strong>. Switching Characters does not interrupt the Cosmos' Mayhem state.\nAfter Cosmos' Mayhem state ends, Encore will cast <strong>Cosmos Rupture</strong>, dealing <strong class=\"color-fusion\">Fusion DMG</strong>, considered as Resonance Liberation damage. \n<strong>Mayhem</strong>\nEncore can hold up to <strong class=\"color-fusion\">100</strong> \"Mayhem\".\nWhen Normal Attack <strong>Wooly Attack</strong> hits a target, Encore restores \"Mayhem\".\nWhen Resonance Skill <strong>Flaming Woolies</strong> hits a target, Encore restores \"Mayhem\".\nWhen Resonance Skill <strong>Energetic Welcome</strong> hits a target, Encore restores \"Mayhem\".\nWhen Intro Skill <strong>Woolies Helpers</strong> hits a target, Encore restores \"Mayhem\".\nDuring the duration of Resonance Liberation <strong>Cosmos Rave</strong>, Encore restores \"Mayhem\" when hitting a target."
    },
    "skillful-cooking": {
      "name": "Skillful Cooking",
      "description": "Has a chance to produce special dishes when cooking"
    },
    "thermal-field": {
      "name": "Thermal Field",
      "description": "Encore generates a Thermal Field centered around skill target, with a radius of <strong class=\"color-fusion\">3</strong>m. Targets inside the Thermal Field are continuously burned, suffering <strong class=\"color-fusion\">Fusion DMG</strong> equal to <strong class=\"color-fusion\">176.76%</strong> of Encore's ATK every <strong class=\"color-fusion\">1.5</strong>s for <strong class=\"color-fusion\">6</strong>s."
    }
  }
}
