{
  "name": "Jianxin",
  "quote": "Release the wants, and the mind quiets. Cleanse the thoughts, and the soul clears.",
  "description": "Jianxin, a Taoist monk and successor of Fengyiquan, has dedicated her life to mastering the ultimate martial art. With the power to harness and transform environmental Chi, she can create protective barriers that purify both body and mind.",
  "skills": {
    "fengyiquan": {
      "name": "Fengyiquan",
      "description": "<strong>Basic Attack</strong>\nJianxin performs up to 4 consecutive attacks, dealing <strong class=\"color-aero\">Aero DMG</strong>.\n \n<strong>Heavy Attack</strong>\nJianxin consumes Stamina to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.\n \n<strong>Mid-air Attack</strong>\nJianxin consumes Stamina to plunge and unleash a powerful kick, dealing <strong class=\"color-aero\">Aero DMG</strong>.\n \n<strong>Dodge Counter</strong>\nUse <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>."
    },
    "calming-air": {
      "name": "Calming Air",
      "description": "Hold <strong>Resonance Skill</strong> to enter <strong>Parry Stance</strong>.\n \n<strong>Chi Counter</strong>\nWhen Jianxin is attacked in the <strong>Parry Stance</strong>, she does not take damage and immediately performs <strong>Chi Counter</strong>, dealing <strong class=\"color-aero\">Aero DMG</strong>.\n \n<strong>Chi Parry</strong>\nRelease the <strong>Resonance Skill</strong> button during <strong>Parry Stance</strong> to interrupt <strong>Parry Stance</strong> and perform <strong>Chi Parry</strong>, dealing <strong class=\"color-aero\">Aero DMG</strong>."
    },
    "purification-force-field": {
      "name": "Purification Force Field",
      "description": "Creates a strong wind field, continuously pulling targets within the wind field to the center and causing <strong class=\"color-aero\">Aero DMG</strong>. When the wind field disappears, it will cause <strong class=\"color-aero\">Aero DMG</strong> to all targets within the range again."
    },
    "formless-release": {
      "name": "Formless Release",
      "description": "Damage of Resonance Liberation <strong>Purification Force Field</strong> is increased by <strong style=\"color: var(--theme-palette-color-1);\">20%</strong>."
    },
    "reflection": {
      "name": "Reflection",
      "description": "The Shield obtained with Heavy Attack <strong>Primordial Chi Spiral</strong> is increased by <strong style=\"color: var(--theme-palette-color-1);\">20%</strong>."
    },
    "essence-of-tao": {
      "name": "Essence of Tao",
      "description": "Pull in targets within the range, dealing <strong class=\"color-aero\">Aero DMG</strong>."
    },
    "primordial-chi-spiral": {
      "name": "Primordial Chi Spiral",
      "description": "<strong>Heavy Attack: Primordial Chi Spiral</strong>\nWhen \"Chi\" reaches max stacks, hold <strong>Heavy Attack</strong> to cast <strong>Primordial Chi Spiral</strong> and start <strong>Zhoutian Progress</strong>.\n \n<strong>Zhoutian Progress</strong>\nJianxin's anti-interruption is increased, and her the damage taken is reduced by <strong class=\"color-aero\">50%</strong>:\nJianxin continuously consumes \"Chi\" and casts <strong>Chi Strike</strong> to attack targets nearby, dealing <strong class=\"color-aero\">Aero DMG</strong>.\nAs <strong>Zhoutian Progress</strong> accumulates, Jianxin reaches different Zhoutian and gain effects accordingly.\nBefore Minor Zhoutian: Gain Zhoutian Progress 1 shield. When Zhoutian Progress is interrupted, cast <strong>Pushing Punch</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.\nMinor Zhoutian: Gain Zhoutian Progress 2 shield and cast <strong>Shock</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.  When <strong>Zhoutian Progress</strong> is interrupted, cast <strong>Yielding Pull</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.\nMajor Zhoutian: Inner: Gain Zhoutian Progress 3 shield and cast <strong>Shock</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>. When Zhoutian Progress is interrupted, cast <strong>Yielding Pull</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.\nMajor Zhoutian: Outer: Gain Zhoutian Progress 4 shield and cast <strong>Shock</strong> to attack the target, dealing <strong class=\"color-aero\">Aero DMG</strong>.\nWhen you release <strong>Basic Attack</strong> button, interrupt <strong>Zhoutian Progress</strong> and lose all \"Chi\";\nWhen all \"Chi\" is consumed, end <strong>Zhoutian Progress</strong>.\n \nWhen <strong>Zhoutian Progress</strong> ends, regain a shield according to the Zhoutian Progress you reached;\nAs the shield provided by <strong>Heavy Attack: Primordial Chi Spiral</strong> persists, restore HP for the on-field character once every <strong class=\"color-aero\">6</strong>s.\n \n<strong>Chi</strong>\nJianxin can hold up to <strong class=\"color-aero\">120</strong> Chi.\nChi is obtained when a Normal Attack <strong>Fengyiquan</strong> hits the target.\nChi is obtained when the Resonance Skill <strong>Calming Air</strong> is cast.\nChi is obtained when the Resonance Skill <strong>Chi Counter</strong> or Resonance Skill <strong>Chi Parry</strong> hits the target.\nChi is obtained when the Intro Skill <strong>Essence of Tao</strong> hits the target."
    },
    "skillful-cooking": {
      "name": "Skillful Cooking",
      "description": "Has a chance to produce special dishes when cooking"
    },
    "transcendence": { "name": "Transcendence", "description": "" }
  }
}
