{
  "name": "Jinhsi",
  "quote": "There's still much to be done. Please rest assured, I am here to guide you through it.",
  "description": "Jinhsi, Magistrate of Jinzhou, gently brightens the hopes of her people, like rays of winter sunlight. \nAs the revered Sentinel's Appointed Resonator, she displays humility and wholeheartedly commits herself to guiding her people towards a brilliant future.",
  "skills": {
    "slash-of-breaking-dawn": {
      "name": "Slash of Breaking Dawn",
      "description": "<strong>Basic Attack</strong>\nPerform up to 4 consecutive strikes, dealing <strong class=\"color-spectro\">Spectro DMG</strong>.\n\nHeavy Attack</color>\nPerform a charged attack by consuming Stamina, dealing <strong class=\"color-spectro\">Spectro DMG</strong>.\n\n<strong>Mid-Air Attack</strong>\nPerform a Plunging Attack while in mid-air by consuming Stamina, dealing <strong class=\"color-spectro\">Spectro DMG</strong>.\n\n<strong>Dodge Counter</strong>\nUse <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to counterattack, dealing <strong class=\"color-spectro\">Spectro DMG</strong>."
    },
    "trailing-lights-of-eons": {
      "name": "Trailing Lights of Eons",
      "description": "Dash forward and perform consecutive strikes that inflict <strong class=\"color-spectro\">Spectro DMG</strong>.\n\n<strong>Overflowing Radiance</strong>\nAfter Jinhsi uses <strong class=\"color-spectro\">Basic Attack 4</strong> or, while not in <strong>Incarnation</strong>, Intro Skill <strong>Loong's Halo</strong>, an alternative Resonance Skill <strong>Overflowing Radiance</strong> becomes available within <strong class=\"color-spectro\">5</strong>s.\nResonance Skill <strong>Overflowing Radiance</strong> inflicts <strong>Spectro DMG</strong> and sends Jinhsi into <strong> Incarnation</strong>.\nCan be cast in mid-air."
    },
    "purge-of-light": {
      "name": "Purge of Light",
      "description": "Unleash the power of a heart's wish to deal <strong>Spectro DMG</strong>.\nCan be cast in mid-air."
    },
    "radiant-surge": {
      "name": "Radiant Surge",
      "description": "Jinhsi's Spectro DMG Bonus is increased by <strong class=\"color-spectro\">20%</strong>."
    },
    "converged-flash": {
      "name": "Converged Flash",
      "description": "Intro Skill <strong>Loong's Halo</strong> gains <strong style=\"color: var(--theme-palette-color-1);\">50%</strong> additional DMG."
    },
    "loong-s-halo": {
      "name": "Loong's Halo",
      "description": "Attack the target, dealing <strong>Spectro DMG</strong>."
    },
    "luminal-synthesis": {
      "name": "Luminal Synthesis",
      "description": "<strong>Incarnation</strong>\nWhile in <strong>Incarnation</strong>:\n- Alternative Basic Attack <strong>\"Incarnation: Basic Attack\"</strong> becomes available. Perform up to 4 consecutive strikes, dealing <strong class=\"color-spectro\">Spectro DMG</strong>. The basic attack cycle of this will not be reset. Can be cast in mid-air.\n- Alternative Resonance Skill <strong>\"Crescent Divinity\"</strong> becomes available. Deal <strong class=\"color-spectro\">Spectro DMG</strong>. Can be cast in mid-air.\n- Alternative Heavy Attack <strong>\"Incarnation: Heavy Attack\"</strong> becomes available. Attack the target in mid-air at the cost of Stamina, dealing <strong class=\"color-spectro\">Spectro DMG</strong>.\n- Alternative Dodge <strong>\"Incarnation: Dodge\"</strong> becomes available while airborne. Can be cast multiple times at the cost of Stamina.\n- Alternative Dodge Counter <strong>\"Incarnation: Dodge Counter\"</strong> becomes available. Deal <strong class=\"color-spectro\">Spectro Damage</strong>.\nCan be cast in mid-air.\n\n<strong>Resonance Skill: Illuminous Epiphany</strong>\nAfter Stage 4 of <strong>Incarnation: Basic Attack</strong>, <strong>Incarnation</strong> terminates and Jinhsi gains <strong>Ordination Glow</strong>. \nCan be cast in mid-air.\nWhile <strong>Ordination Glow</strong> lasts:\n- Basic Attack is replaced with the Alternative Heavy Attack <strong>\"Incarnation: Heavy Attack\"</strong> when airborne. Attack the target in mid-air at the cost of Stamina, dealing <strong class=\"color-spectro\">Spectro DMG</strong>.\nResonance Skill is replaced with Resonance Skill <strong>Illuminous Epiphany</strong>. Send out <strong>Solar Flare</strong> that detonates as <strong>Stella Glamour</strong> that deals <strong class=\"color-spectro\">Spectro Damage</strong> after a short delay. When Jinhsi has \"Incandescence\", consume up to <strong class=\"color-spectro\">40</strong> Incandescence, each point of Incandescence grants an additional DMG multiplier percentage to the <strong>Star Glamour</strong>. Can be cast in mid-air.\nAfter casting Resonance Skill <strong>Illuminous Epiphany</strong>, Jinhsi gains <strong>Unison</strong>. This can be triggered once in <strong class=\"color-spectro\">25</strong>s.\n\n<strong>Unison</strong>\nWhile Jinhsi has <strong>Unison</strong>, switching to other Characters will remove Jinhsi's <strong>Unison</strong> to trigger Jinhsi's Outro Skill and the incoming character's Intro Skill. <strong>Unison</strong> will be consumed in priority in place of Concerto Energy when Concerto Energy is full.\n\n<strong>Incandescence</strong>\nJinhsi can hold up to <strong class=\"color-spectro\">40</strong> Incandescence。\nWhen Jinhsi is on the team, all nearby characters on the team gain <strong>Eras in Unity</strong>. When characters with <strong>Eras in Unity</strong> deal Damage with an attribute, Jinhsi gains <strong class=\"color-spectro\">1</strong> Incandescence. Damage of the same attribute can provide up to <strong class=\"color-spectro\">1</strong> Incandescence every <strong class=\"color-spectro\">3</strong>s."
    },
    "skill-1002008-skill-name": {
      "name": "Skill_1002008_SkillName",
      "description": "Skill_1002008_SkillDescribe"
    },
    "temporal-bender": {
      "name": "Temporal Bender",
      "description": "With the power homologous with the Sentinel, Jinhsi reduces the Cooldown of <strong>Eras in Unity</strong> to <strong style=\"color: var(--theme-palette-color-1);\">1</strong>s. This lasts for <strong style=\"color: var(--theme-palette-color-1);\">20</strong>s."
    }
  }
}
