{
  "name": "Yuanwu",
  "quote": "Assuming I've thought my decisions through and acted with integrity, I am content.",
  "description": "Yuanwu owns a boxing gym where he teaches martial arts and health management. He is well-respected in the community for his cordial demeanor and pleasant temperament.",
  "skills": {
    "leihuangquan": {
      "name": "Leihuangquan",
      "description": "<strong>Basic Attack</strong>\nYuanwu performs up to 5 consecutive attacks, dealing <strong class=\"color-electro\">Electro DMG</strong>.\n \n<strong>Heavy Attack</strong>\nYuanwu consumes Stamina to attack the target, dealing <strong class=\"color-electro\">Electro DMG</strong>.\n \n<strong>Mid-air Attack</strong>\nYuanwu consumes Stamina to launch a Mid-air Plunging Attack, dealing <strong class=\"color-electro\">Electro DMG</strong>.\n \n<strong>Dodge Counter</strong>\nUse <strong>Basic Attack</strong> after a successful <strong>Dodge</strong> to attack the target, dealing <strong class=\"color-electro\">Electro DMG</strong>."
    },
    "leihuang-master": {
      "name": "Leihuang Master",
      "description": "<strong>Thunder Wedge</strong>\nYuanwu summons <strong>Thunder Wedge</strong>, dealing <strong class=\"color-electro\">Electro DMG</strong>, and forms a <strong>Thunder Field</strong> centered on the <strong>Thunder Wedge</strong>. <strong>Thunder Wedge</strong> lasts for <strong class=\"color-electro\">12</strong>s.\nForte Circuit <strong>Rumbling Spark</strong> and Resonance Liberation <strong>Blazing Might</strong> will immediately detonate Resonance Skill <strong>Thunder Wedge</strong> on the field, dealing <strong class=\"color-electro\">Electro DMG</strong>, considered as Resonance Skill Damage.\n \n<strong>Thunder Field</strong>\nThe on-field character gains the effects below when in the <strong>Thunder Field</strong>: a Coordinated Attack from Resonance Skill <strong>Thunder Wedge</strong> is triggered when attacks hit a target, dealing <strong class=\"color-electro\">Electro DMG</strong>. This can be triggered once every <strong class=\"color-electro\">1.2</strong>s. The effect lasts for <strong class=\"color-electro\">1.5</strong>s."
    },
    "blazing-might": {
      "name": "Blazing Might",
      "description": "Awaken the power of thunder and provide Forte Circuit <strong>Lightning Infused</strong> status for all nearby characters for <strong class=\"color-electro\">10</strong>s, granting them increased Anti-interruption, then perform a powerful blow that deals <strong class=\"color-electro\">Electro DMG</strong>.\n "
    },
    "thunderweaver": {
      "name": "Thunderweaver",
      "description": "The damage multiplier of Resonance Skill <strong>Thunder Uprising</strong> is increased by <strong style=\"color: var(--theme-palette-color-1);\">40%</strong>, and its depletion of enemy Vibration Strength is enhanced."
    },
    "reserved-confidence": {
      "name": "Reserved Confidence",
      "description": "The ranges of the Resonance Skill <strong>Thunder Field</strong> and <strong>Thunder Uprising</strong> are greatly expanded. When exiting during combat, if <strong>Readiness</strong> is not full, Yuanwu will automatically leave <strong style=\"color: var(--theme-palette-color-1);\">1</strong> Resonance Skill <strong>Thunder Wedge</strong> in place."
    },
    "thunder-bombardment": {
      "name": "Thunder Bombardment",
      "description": "Attack the target, dealing <strong class=\"color-electro\">Electro DMG</strong>."
    },
    "unassuming-blade": {
      "name": "Unassuming Blade",
      "description": "<strong>Rumbling Spark</strong>\nWhen \"Readiness\" is full, long press Resonance Skill to consume all \"Readiness\" and cast Rumbling Spark, dealing <strong class=\"color-electro\">Electro DMG</strong> and entering the <strong>Lightning Infused</strong> state.\n \n<strong>Thunder Uprising</strong>\nWhen you have full \"Readiness\", Resonance Skill <strong>Thunder Wedge</strong> will cast <strong>Thunder Uprising</strong>, dealing <strong class=\"color-electro\">Electro DMG</strong>.\n \n<strong>Lightning Infused</strong>\nThe character in <strong>Lightning Infused</strong> state has a greatly increased anti-interruption.\nWhen Yuanwu is in this state:\n-<strong>Basic Attacks</strong>: Hits targets in a larger range, depletes enemy Vibration Strength faster;\n-<strong>Heavy Attacks</strong>: Attack speed is increased, deplete enemy Vibration Strength faster;\n-<strong>Dodge Counters</strong>: Attack speed is increased, deplete enemy Vibration Strength faster.\n-Use <strong>Basic Attack</strong> within <strong class=\"color-electro\">3</strong>s after casting a <strong>Heavy Attack</strong> or a successful <strong>Counterattack</strong> to cast <strong>Thunderweaver</strong>, dealing <strong class=\"color-electro\">Electro DMG</strong>, considered as Basic Attack damage;\nYuanwu does not recover \"Readiness\" in this state.\n \n<strong>Readiness</strong>\nYuanwu can hold up to <strong class=\"color-electro\">100</strong> \"Readiness\".\nWhen Resonance Skill <strong>Thunder Wedge</strong> is on the field, Yuanwu gains <strong class=\"color-electro\">6</strong> \"Readiness\" every second, even when he is not the on-field character;\nWhen Resonance Skill <strong>Thunder Wedge</strong> hits a target with a Coordinated Attack, Yuanwu gains <strong class=\"color-electro\">5</strong> \"Readiness\"."
    },
    "skillful-cooking": {
      "name": "Skillful Cooking",
      "description": "Has a chance to produce special dishes when cooking"
    },
    "lightning-manipulation": {
      "name": "Lightning Manipulation",
      "description": "Yuanwu unleashes thunderbolts in an area centered around the skill target, weakening the Vibration Strength of enemies upon impact."
    }
  }
}
